<?php

class Config_Setting_AjaxTemplateConvert13to15 extends Base_AjaxBase
{

    function _execute(&$form)
    {
        return
            array(
                'msg' => self::convertTemplate13to15(),
            );
    }

    // 13i ⇒ 15i テンプレートコンバータ
    //  ユーザーテンプレートのみ
    function convertTemplate13to15()
    {
        $msg = "";

        $storage = new Gen_Storage("ReportTemplates");
        $templateArr = $storage->listFiles();
        foreach($templateArr as $category) {
            $data = self::_getConvertData($category);
            if (!$data) {
                continue;
            }
            $action = $data[0];
            $repArr = $data[1];

            if (!$storage->exist($category . "/gen_templates.dat")) {
                $msg .= "テンプレートディレクトリ {$category} に gen_templates.dat がありません。<br>";
                continue;
            }

            // タグ変換リスト（$repArr）
            $tag13arr = array();
            $tag15arr = array();
            $tag13arrNoBracket = array();
            $tag15arrNoBracket = array();
            foreach($repArr as $tag13 => $tag15) {
                $tag13arr[] = $tag13;
                $tag15arr[] = $tag15;
                $tag13arrNoBracket[] = str_replace("[[", "", str_replace("]]", "", $tag13));
                $tag15arrNoBracket[] = str_replace("[[", "", str_replace("]]", "", $tag15));
            }

            // レポートクラスからタグリストを取得
            require_once(Gen_File::safetyPathForAction($action));
            $obj = new $action;
            $dummy = null;
            $param = $obj->getReportParam($dummy);
            $tags = array();
            foreach ($param['tagList'] as $tagInfo) {
                if (count($tagInfo) > 1) {    // タグカテゴリ見出しは除く
                    $tags[] = $tagInfo[0];
                }
            }

            // ディレクトリ内のテンプレートを1つずつ処理
            $datFile = $storage->get($category . "/gen_templates.dat");
            $fp = fopen($datFile, 'r');
            while ($str = fgets($fp)) {
                $pArr = explode(",", trim($str));
                $filename = $pArr[0];
                if (!$storage->exist($category . "/" . $filename)) {
                    $msg .= "テンプレートディレクトリ {$category} の gen_templates.dat に記述されているファイル {$filename} は存在しません。<br>";
                    continue;
                }
                $filePathName = $storage->get($category . "/" . $filename);
                $res = self::_convertOneFile($filePathName, $tag13arr, $tag15arr, $tag13arrNoBracket, $tag15arrNoBracket, $tags);
                if ($res == 0) {
                    $msg .= "変換： {$category} / {$filename}<br>";
                } else if ($res == 1) {
                     $msg .= "変換： {$category} / {$filename} （タグ [[複製ページ]] は15iでは使用できないため、消去されました。）<br>";
                } else if ($res == 3) {
                     $msg .= "エラー： {$category} / {$filename} （3つ以上のシートが含まれています。）<br>";
               } else {
                    $msg .= "変換不要： {$category} / {$filename}<br>";
                }
            }
            fclose($fp);
        }
        return $msg;
    }

    private function _convertOneFile($filePathName, $tag13arr, $tag15arr, $tag13arrNoBracket, $tag15arrNoBracket, $tags)
    {
        require_once(ROOT_DIR . 'PHPExcel/PHPExcel/IOFactory.php');
        $reader = PHPExcel_IOFactory::createReader('Excel5');
        if (!$reader->canRead($filePathName)) {
            return _g("テンプレートファイルが正しくありません。.xls形式のテンプレートファイルを指定してください。") . "<br>" . _g("（Excel 2007以降をご利用の方は「Excel 97-2003 ブック」形式でファイルを保存してください。）");
        }

        // load時にPHPExcel内でnoticeが発生したら、エラーとして停止する。
        // シートに画像が含まれている場合にPHPExcelがハングしてしまうことがある問題への対策。
        // かなり苦肉の策なので、PHPExcelのバグが解消された時点でここも修正したほうがいい。
        set_error_handler(array('Config_Setting_AjaxTemplateConvert13to15', 'uploadErrorHandler'));
        try {
            $xl = $reader->load($filePathName);
        } catch (Exception $e) {
            restore_error_handler();
            return _g("テンプレートの読み込み時にエラーが発生しました。シート内に含まれている画像をいったん削除し、再度「図の挿入」を行ってからアップロードしてみてください。");
        }
        restore_error_handler();

        // 15iでは不要なシートが含まれていると帳票発行時に問題がある。（13iでは問題なかった）
        // また、変換処理は2シート分しか行われない。3シート以上含まれていると、無関係なシートを処理対象にしてしまい変換不要と判断されてしまうことがある。
        if ($xl->getSheetCount() > 2) {
            return 3;
        }

        // テンプレートのタグチェック
        $sheetIndexMax = ($xl->getSheetCount() > 1 ? 1 : 0);
        $exist13Tag = false;
        $existBadTag = false;
        for($sheetIndex=0; $sheetIndex<=$sheetIndexMax; $sheetIndex++) {
            $xl->setActiveSheetIndex($sheetIndex);
            $sheet = $xl->getActiveSheet();
            $yMax = $sheet->getHighestRow();      // 行：　1はじまり
            $xMax = PHPExcel_Cell::columnIndexFromString($sheet->getHighestColumn());   // 列：　0はじまり
            for ($x = 0; $x <= $xMax; $x++) {   // $xは0はじまり
                for ($y = 1; $y <= $yMax; $y++) {
                    $value = $sheet->getCellByColumnAndRow($x, $y)->getValue();
                    // タグがあるセルだけを処理
                    if (strpos($value, "[[") === FALSE) {
                        continue;
                    }
                    // 13i ⇒ 15i タグ変換
                    if ($x == 0 && $y == 1) {
                        // A1セル
                        $afterValue = self::_replaceSpecialTag($value, $tag13arrNoBracket, $tag15arrNoBracket);
                    } else {
                        // 通常セル
                        $afterValue = str_replace($tag13arr, $tag15arr, $value);
                        if (strpos($afterValue, "[[barcode:") !== FALSE || strpos($afterValue, "[[image:") !== FALSE || strpos($afterValue, "[[barcode:") !== FALSE || strpos($afterValue, "[[total:") !== FALSE) {
                            $afterValue = self::_replaceSpecialTag($afterValue, $tag13arrNoBracket, $tag15arrNoBracket);
                        }
                    }
                    // 15iでは [[複製ページ]] を廃止した
                    if (strpos($afterValue, "[[複製ページ]]") !== FALSE) {
                        $existBadTag = true;
                        $afterValue = str_replace("[[複製ページ]]", "", $afterValue);
                    }
                    // 変換値の書き込み
                    if ($afterValue != $value) {
                        $exist13Tag = true;
                        $sheet->getCellByColumnAndRow($x, $y)->setValue($afterValue);
                    }
                    // 本来はここで全タグチェック（$tagsにこの帳票で使用できるタグリストが入っている）
                    // するといいが、使えないタグが含まれていることはないであろうという前提で、省略した
                }
            }
        }
        // ファイルの保存
        if ($exist13Tag) {
            $writer = PHPExcel_IOFactory::createWriter($xl, 'Excel5');
            $writer->save($filePathName);
        }
        if ($existBadTag) {
            return 1;
        } else if ($exist13Tag) {
            return 0;
        } else {
            return 2;
        }
    }

    private function _replaceSpecialTag($value, $tag13arrNoBracket, $tag15arrNoBracket)
    {
        $matches = "";
        if (preg_match_all("(\[\[[^\]]*\]\])", $value, $matches) == 0) {
            return $value;
        }
        $afterValue = $value;
        foreach ($matches[0] as $match) {
            $tagInside = str_replace("[[", "", str_replace("]]", "", $match));
            $tagInsideArr = explode(":", $tagInside);
            if (count($tagInsideArr) != 2) {
                continue;
            }
            $tagCsv = $tagInsideArr[1];
            $tagArr = explode(",", $tagCsv);
            foreach($tagArr as $key => $tag) {
                foreach($tag13arrNoBracket as $tag13key => $tag13val) {
                    // タグの一部が一致する可能性があるので、str_replaceによる置換はできない
                    if ($tag == $tag13val) {
                        $tagArr[$key] = $tag15arrNoBracket[$tag13key];
                        continue;
                    }
                }
            }
            $afterTagCsv = join(",", $tagArr);
            $afterValue = str_replace($tagCsv, $afterTagCsv, $afterValue);
        }
        return $afterValue;
    }

    // ファイルオープン時のnoticeを捕捉するためのハンドラ
    function uploadErrorHandler($errno, $errstr, $errfile, $errline)
    {
        throw new Exception($errstr, $errno);
    }

    private function _getConvertData($category) {
        switch($category) {
            case "BaseCost" :
                $action = "Manufacturing_Order_Report";
                $repArr = array(
                    "[[品目コード]]" => "[[品目マスタ_品目コード]]",
                    "[[品目名]]" => "[[品目マスタ_品目名]]",
                    "[[単位]]" => "[[品目マスタ_管理単位]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[得意先_郵便番号]]",
                    "[[取引先住所1]]" => "[[得意先_住所1]]",
                    "[[取引先住所2]]" => "[[得意先_住所2]]",
                    "[[取引先電話番号]]" => "[[得意先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[得意先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[得意先_担当者]]",
                    "[[製番]]" => "[[原価表_製番]]",
                    "[[受注番号]]" => "[[原価表_受注番号]]",
                    "[[受注数]]" => "[[原価表_受注数]]",
                    "[[受注金額]]" => "[[原価表_受注金額]]",
                    "[[受注日]]" => "[[原価表_受注日]]",
                    "[[納期]]" => "[[原価表_納期]]",
                    "[[原価]]" => "[[原価表_原価]]",
                    "[[子品目コード]]" => "[[原価表_子品目コード]]",
                    "[[子品目名]]" => "[[原価表_子品目名]]",
                    "[[子品目区分]]" => "[[原価表_子品目区分]]",
                    "[[子品目単位]]" => "[[原価表_子品目単位]]",
                    "[[工程コード]]" => "[[原価表_工程コード]]",
                    "[[工程名]]" => "[[原価表_工程名]]",
                    "[[品目コード（ソート用）]]" => "[[原価表_品目コード（ソート用）]]",
                    "[[工順]]" => "[[原価表_工順]]",
                    "[[在庫使用数]]" => "[[原価表_在庫使用数]]",
                    "[[標準原価]]" => "[[原価表_標準原価]]",
                    "[[在庫使用分金額]]" => "[[原価表_在庫使用分金額]]",
                    "[[製造数]]" => "[[原価表_製造数]]",
                    "[[製造時間]]" => "[[原価表_製造時間]]",
                    "[[製造金額]]" => "[[原価表_製造原価]]",
                    "[[製造単価]]" => "[[原価表_製造単価]]",
                    "[[購入外製数]]" => "[[原価表_購入外製数]]",
                    "[[購入単価]]" => "[[原価表_購入単価]]",
                    "[[購入金額]]" => "[[原価表_購入原価]]",
                    "[[購入外製先名]]" => "[[原価表_購入外製先名]]",
                    "[[子品目原価]]" => "[[原価表_子品目原価]]",
                );
                break;
            case "Bill" :
                $action = "Monthly_Bill_Report";
                $repArr = array(
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[得意先_郵便番号]]",
                    "[[取引先住所1]]" => "[[得意先_住所1]]",
                    "[[取引先住所2]]" => "[[得意先_住所2]]",
                    "[[取引先電話番号]]" => "[[得意先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[得意先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[得意先_担当者]]",
                    "[[帳票言語区分]]" => "[[得意先_帳票言語区分]]",
                    "[[取引先備考1]]" => "[[得意先_備考1]]",
                    "[[取引先備考2]]" => "[[得意先_備考2]]",
                    "[[取引先備考3]]" => "[[得意先_備考3]]",
                    "[[取引先備考4]]" => "[[得意先_備考4]]",
                    "[[取引先備考5]]" => "[[得意先_備考5]]",
                    "[[発送先コード]]" => "[[発送先_取引先コード]]",
                    "[[発送先名]]" => "[[発送先_取引先名]]",
                    "[[通貨]]" => "[[通貨マスタ_通貨]]",
                    "[[請求書番号]]" => "[[請求書_請求書番号]]",
                    "[[前回ご請求高]]" => "[[請求書_前回ご請求高]]",
                    "[[ご入金高]]" => "[[請求書_ご入金高]]",
                    "[[繰越高]]" => "[[請求書_繰越高]]",
                    "[[今回お買い上高]]" => "[[請求書_今回お買い上高]]",
                    "[[合計消費税]]" => "[[請求書_合計消費税]]",
                    "[[合計金額]]" => "[[請求書_合計金額]]",
                    "[[今回ご請求高]]" => "[[請求書_今回ご請求高]]",
                    "[[締日]]" => "[[請求書_締日]]",
                    "[[回収予定日]]" => "[[請求書_回収予定日]]",
                    "[[受注取引先小計]]" => "[[請求書_受注取引先小計]]",
                    "[[納品日]]" => "[[請求書_納品日]]",
                    "[[検収日]]" => "[[請求書_検収日]]",
                    "[[納品書番号]]" => "[[請求書_納品書番号]]",
                    "[[受注番号]]" => "[[請求書_受注番号]]",
                    "[[客先注番]]" => "[[請求書_客先注番]]",
                    "[[受注行番号]]" => "[[請求書_受注行番号]]",
                    "[[受注製番]]" => "[[請求書_受注製番]]",
                    "[[品目コード]]" => "[[請求書_品目コード]]",
                    "[[品目名]]" => "[[請求書_品目名]]",
                    "[[単位]]" => "[[請求書_単位]]",
                    "[[数量]]" => "[[請求書_数量]]",
                    "[[単価]]" => "[[請求書_単価]]",
                    "[[金額]]" => "[[請求書_金額]]",
                    "[[納品書金額]]" => "[[請求書_納品書金額]]",
                    "[[消費税]]" => "[[請求書_消費税]]",
                    "[[ロット番号]]" => "[[請求書_ロット番号]]",
                    "[[納品備考]]" => "[[請求書_納品備考]]",
                    "[[受注取引先コード]]" => "[[請求書_受注取引先コード]]",
                    "[[受注取引先名]]" => "[[請求書_受注取引先名]]",
                    "[[納品書番号（ソート用）]]" => "[[請求書_納品書番号（ソート用）]]",
                    "[[納品書行番号（ソート用）]]" => "[[請求書_納品書行番号（ソート用）]]",
                );
                break;
            case "Delivery" :
                $action = "Delivery_Delivery_Report";
                $repArr = array(
                    "[[納品書番号]]" => "[[納品_納品書番号]]",
                    "[[納品日]]" => "[[納品_納品日]]",
                    "[[検収日]]" => "[[納品_検収日]]",
                    "[[自社担当者名]]" => "[[納品_自社担当者名]]",
                    "[[備考1]]" => "[[納品_備考1]]",
                    "[[備考2]]" => "[[納品_備考2]]",
                    "[[備考3]]" => "[[納品_備考3]]",
                    "[[納品書行番号]]" => "[[納品_行番号]]",
                    "[[数量]]" => "[[納品_数量]]",
                    "[[箱数]]" => "[[納品_箱数]]",
                    "[[単価]]" => "[[納品_単価]]",
                    "[[金額]]" => "[[納品_金額]]",
                    "[[消費税]]" => "[[納品_消費税]]",
                    "[[税込金額]]" => "[[納品_税込金額]]",
                    "[[ロット番号]]" => "[[納品_ロット番号]]",
                    "[[明細備考]]" => "[[納品_明細備考]]",
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[得意先_郵便番号]]",
                    "[[取引先住所1]]" => "[[得意先_住所1]]",
                    "[[取引先住所2]]" => "[[得意先_住所2]]",
                    "[[取引先電話番号]]" => "[[得意先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[得意先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[得意先_担当者]]",
                    "[[帳票言語区分]]" => "[[得意先_帳票言語区分]]",
                    "[[取引先備考1]]" => "[[得意先_備考1]]",
                    "[[取引先備考2]]" => "[[得意先_備考2]]",
                    "[[取引先備考3]]" => "[[得意先_備考3]]",
                    "[[取引先備考4]]" => "[[得意先_備考4]]",
                    "[[取引先備考5]]" => "[[得意先_備考5]]",
                    "[[発送先コード]]" => "[[発送先_取引先コード]]",
                    "[[発送先名]]" => "[[発送先_取引先名]]",
                    "[[発送先郵便番号]]" => "[[発送先_郵便番号]]",
                    "[[発送先住所1]]" => "[[発送先_住所1]]",
                    "[[発送先住所2]]" => "[[発送先_住所2]]",
                    "[[発送先電話番号]]" => "[[発送先_電話番号]]",
                    "[[発送先ファックス番号]]" => "[[発送先_ファックス番号]]",
                    "[[発送先担当者名]]" => "[[発送先_担当者]]",
                    "[[発送先備考1]]" => "[[発送先_備考1]]",
                    "[[発送先備考2]]" => "[[発送先_備考2]]",
                    "[[発送先備考3]]" => "[[発送先_備考3]]",
                    "[[発送先備考4]]" => "[[発送先_備考4]]",
                    "[[発送先備考5]]" => "[[発送先_備考5]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注行番号]]" => "[[受注_行番号]]",
                    "[[製番]]" => "[[受注_製番]]",
                    "[[受注数量]]" => "[[受注_受注数]]",
                    "[[受注納期]]" => "[[受注_納期]]",
                    "[[見積番号]]" => "[[見積_見積番号]]",
                    "[[品目コード]]" => "[[品目マスタ_品目コード]]",
                    "[[品目名]]" => "[[品目マスタ_品目名]]",
                    "[[単位]]" => "[[品目マスタ_管理単位]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[入数]]" => "[[品目マスタ_入数]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[取引通貨]]" => "[[通貨マスタ_通貨]]",
                    "[[受注担当者]]" => "[[従業員マスタ_従業員名]]",
                    "[[受注部門]]" => "[[部門マスタ_部門名]]",
                    "[[総合計金額]]" => "[[納品_総合計金額]]",
                    "[[総合計消費税]]" => "[[納品_総合計消費税]]",
                    "[[総税込金額]]" => "[[納品_総税込金額]]",
                );
                break;
            case "Estimate" :
                $action = "Manufacturing_Estimate_Report";
                $repArr = array(
                    "[[見積番号]]" => "[[見積_見積番号]]",
                    "[[取引先名]]" => "[[見積_取引先名]]",
                    "[[発行日]]" => "[[見積_発行日]]",
                    "[[件名]]" => "[[見積_件名]]",
                    "[[取引先郵便番号]]" => "[[見積_郵便番号]]",
                    "[[取引先住所1]]" => "[[見積_取引先住所1]]",
                    "[[取引先住所2]]" => "[[見積_取引先住所2]]",
                    "[[取引先電話番号]]" => "[[見積_取引先電話番号]]",
                    "[[取引先ファックス番号]]" => "[[見積_取引先ファックス番号]]",
                    "[[担当者名]]" => "[[見積_客先担当者名]]",
                    "[[受渡期日]]" => "[[見積_受渡期日]]",
                    "[[受渡場所]]" => "[[見積_受渡場所]]",
                    "[[お支払条件]]" => "[[見積_お支払条件]]",
                    "[[有効期限]]" => "[[見積_有効期限]]",
                    "[[備考]]" => "[[見積_備考]]",
                    "[[見積書行番号]]" => "[[見積_行番号]]",
                    "[[品目コード]]" => "[[見積_品目コード]]",
                    "[[品目名]]" => "[[見積_品目名]]",
                    "[[数量]]" => "[[見積_数量]]",
                    "[[単位]]" => "[[見積_単位]]",
                    "[[単価]]" => "[[見積_単価]]",
                    "[[金額]]" => "[[見積_金額]]",
                    "[[原単価]]" => "[[見積_原単価]]",
                    "[[原単価]]" => "[[見積_原価]]",
                    "[[消費税額]]" => "[[見積_消費税額]]",
                    "[[明細備考]]" => "[[見積_明細備考]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[自社担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[自社部門名]]" => "[[部門マスタ_部門名]]",
                    "[[合計金額]]" => "[[見積_合計金額]]",
                    "[[合計消費税額]]" => "[[見積_合計消費税額]]",
                    "[[税込合計金額]]" => "[[見積_税込合計金額]]",
                );
                break;
            case "Item" :
                $action = "Master_Item_Report";
                $repArr = array(
                    "[[品目コード]]" => "[[品目マスタ_品目コード]]",
                    "[[品目名]]" => "[[品目マスタ_品目名]]",
                    "[[品目グループ1]]" => "[[品目マスタ_品目グループ名1]]",
                    "[[品目グループ2]]" => "[[品目マスタ_品目グループ名2]]",
                    "[[品目グループ3]]" => "[[品目マスタ_品目グループ名3]]",
                    "[[管理単位]]" => "[[品目マスタ_管理単位]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[標準ロケ受入]]" => "[[品目マスタ_標準ロケ名_受入]]",
                    "[[標準ロケ使用]]" => "[[品目マスタ_標準ロケ名_使用]]",
                    "[[標準ロケ完成]]" => "[[品目マスタ_標準ロケ名_完成]]",
                    "[[備考1]]" => "[[品目マスタ_備考1]]",
                    "[[備考2]]" => "[[品目マスタ_備考2]]",
                    "[[備考3]]" => "[[品目マスタ_備考3]]",
                    "[[備考4]]" => "[[品目マスタ_備考4]]",
                    "[[備考5]]" => "[[品目マスタ_備考5]]",
                    "[[安全在庫数]]" => "[[品目マスタ_安全在庫数]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                );
                break;
            case "ManufacturingOrder" :
                $action = "Manufacturing_Order_Report";
                $repArr = array(
                    "[[製造開始日]]" => "[[製造指示_製造開始日]]",
                    "[[備考]]" => "[[製造指示_備考]]",
                    "[[オーダー番号]]" => "[[製造指示_オーダー番号]]",
                    "[[納期]]" => "[[製造指示_納期]]",
                    "[[品目コード]]" => "[[製造指示_品目コード]]",
                    "[[品目名]]" => "[[製造指示_品目名]]",
                    "[[数量]]" => "[[製造指示_数量]]",
                    "[[箱数]]" => "[[製造指示_箱数]]",
                    "[[製造残数]]" => "[[製造指示_製造残数]]",
                    "[[製番]]" => "[[製造指示_製番]]",
                    "[[単位]]" => "[[品目マスタ_管理単位]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[入数]]" => "[[品目マスタ_入数]]",
                    "[[品目標準ロケ完成]]" => "[[品目マスタ_標準ロケ名_完成]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[安全在庫数]]" => "[[品目マスタ_リードタイム]]",
                    "[[安全リードタイム]]" => "[[品目マスタ_最低ロット数]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注日]]" => "[[受注_受注日]]",
                    "[[受注備考]]" => "[[受注_備考1]]",
                    "[[受注数]]" => "[[受注_受注数]]",
                    "[[受注単価]]" => "[[受注_単価]]",
                    "[[受注納期]]" => "[[受注_納期]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[得意先名]]" => "[[得意先_取引先名]]",
                    "[[出荷先名]]" => "[[発送先_取引先名]]",
                    "[[受注担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[受注部門名]]" => "[[部門マスタ_部門名]]",
                    "[[リードタイム]]" => "[[製造指示_リードタイム]]",
                    "[[受注品目コード]]" => "[[製造指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[製造指示_受注品目名]]",
                    "[[子品目コード]]" => "[[製造指示_子品目コード]]",
                    "[[子品目名]]" => "[[製造指示_子品目名]]",
                    "[[員数]]" => "[[製造指示_員数]]",
                    "[[子品目数]]" => "[[製造指示_子品目数]]",
                    "[[子品目単位]]" => "[[製造指示_子品目単位]]",
                    "[[子品目仕様]]" => "[[製造指示_子品目仕様]]",
                    "[[子品目メーカー]]" => "[[製造指示_子品目メーカー]]",
                    "[[子品目棚番]]" => "[[製造指示_子品目棚番]]",
                    "[[子品目標準ロケ使用]]" => "[[製造指示_子品目標準ロケ使用]]",
                    "[[子品目備考1]]" => "[[製造指示_子品目備考1]]",
                    "[[子品目備考2]]" => "[[製造指示_子品目備考2]]",
                    "[[子品目備考3]]" => "[[製造指示_子品目備考3]]",
                    "[[子品目備考4]]" => "[[製造指示_子品目備考4]]",
                    "[[子品目備考5]]" => "[[製造指示_子品目備考5]]",
                    "[[子品目グループコード]]" => "[[製造指示_子品目グループコード]]",
                    "[[子品目グループ名]]" => "[[製造指示_子品目グループ名]]",
                    "[[子品目構成表ソート番号]]" => "[[製造指示_子品目構成表ソート番号]]",
                );
                // 以下は工程関連。工程数は gen_config.yml の変更により変えられるため、タグ数がいくつあるかはわからない。
                // 最大50工程と想定する。
                for ($i=1; $i<=50; $i++) {
                    $repArr["[[実績登録コード{$i}]]"] = "[[製造指示_工程{$i}_実績登録コード]]";
                    $repArr["[[工程コード{$i}]]"] = "[[製造指示_工程{$i}_工程コード]]";
                    $repArr["[[工程名{$i}]]"] = "[[製造指示_工程{$i}_工程名]]";
                    $repArr["[[外製先{$i}]]"] = "[[製造指示_工程{$i}_外製先]]";
                    $repArr["[[工程納期{$i}]]"] = "[[製造指示_工程{$i}_工程納期]]";
                    $repArr["[[工程メモ1_{$i}]]"] = "[[製造指示_工程{$i}_工程メモ1]]";
                    $repArr["[[工程メモ2_{$i}]]"] = "[[製造指示_工程{$i}_工程メモ2]]";
                    $repArr["[[工程メモ3_{$i}]]"] = "[[製造指示_工程{$i}_工程メモ3]]";
                }
                break;
            case "ManufacturingOrder2" :
                $action = "Manufacturing_Order_Report2";
                $repArr = array(
                    "[[製造開始日]]" => "[[製造指示_製造開始日]]",
                    "[[備考]]" => "[[製造指示_備考]]",
                    "[[オーダー番号]]" => "[[製造指示_オーダー番号]]",
                    "[[納期]]" => "[[製造指示_納期]]",
                    "[[品目コード]]" => "[[製造指示_品目コード]]",
                    "[[品目名]]" => "[[製造指示_品目名]]",
                    "[[数量]]" => "[[製造指示_数量]]",
                    "[[単位]]" => "[[製造指示_箱数]]",
                    "[[製番]]" => "[[製造指示_製番]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[安全在庫数]]" => "[[品目マスタ_安全在庫数]]",
                    "[[安全リードタイム]]" => "[[品目マスタ_安全リードタイム]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注日]]" => "[[受注_受注日]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注数]]" => "[[受注_受注数]]",
                    "[[受注単価]]" => "[[受注_単価]]",
                    "[[受注納期]]" => "[[受注_納期]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[得意先名]]" => "[[得意先_取引先名]]",
                    "[[出荷先名]]" => "[[発送先_取引先名]]",
                    "[[受注担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[受注部門名]]" => "[[部門マスタ_部門名]]",
                    "[[リードタイム]]" => "[[製造指示_リードタイム]]",
                    "[[受注品目コード]]" => "[[製造指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[製造指示_受注品目名]]",
                    "[[実績登録コード]]" => "[[製造指示_実績登録コード]]",
                    "[[工程コード]]" => "[[製造指示_工程コード]]",
                    "[[工程名]]" => "[[製造指示_工程名]]",
                    "[[工程納期]]" => "[[製造指示_工程納期]]",
                    "[[工程番号（ソート用）]]" => "[[製造指示_工程番号（ソート用）]]",
                );
                break;
            case "PartnerOrder" :
                $action = "Partner_Order_Report";
                $repArr = array(
                    "[[注文書番号]]" => "[[注文_注文書番号]]",
                    "[[発注日]]" => "[[注文_発注日]]",
                    "[[備考]]" => "[[注文_備考]]",
                    "[[注文書行番号]]" => "[[注文_行番号]]",
                    "[[オーダー番号]]" => "[[注文_オーダー番号]]",
                    "[[品目コード]]" => "[[注文_品目コード]]",
                    "[[品目名]]" => "[[注文_品目名]]",
                    "[[数量]]" => "[[注文_数量]]",
                    "[[管理単位数量]]" => "[[注文_管理単位数量]]",
                    "[[箱数]]" => "[[注文_箱数]]",
                    "[[手配単位倍数]]" => "[[注文_手配単位倍数]]",
                    "[[単位]]" => "[[注文_単位]]",
                    "[[単価]]" => "[[注文_単価]]",
                    "[[納期]]" => "[[注文_納期]]",
                    "[[消費税]]" => "[[注文_消費税]]",
                    "[[課税区分]]" => "[[注文_課税区分]]",
                    "[[金額]]" => "[[注文_金額]]",
                    "[[税込金額]]" => "[[注文_税込金額]]",
                    "[[発注残]]" => "[[注文_残数]]",
                    "[[明細備考]]" => "[[注文_明細備考]]",
                    "[[製番]]" => "[[注文_製番]]",
                    "[[型番]]" => "[[注文_メーカー型番]]",
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[取引先_郵便番号]]",
                    "[[取引先住所1]]" => "[[取引先_住所1]]",
                    "[[取引先住所2]]" => "[[取引先_住所2]]",
                    "[[取引先電話番号]]" => "[[取引先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[取引先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[取引先_担当者]]",
                    "[[注文書区分]]" => "[[取引先_帳票言語区分]]",
                    "[[取引先納入場所]]" => "[[取引先_納入場所]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[発送先コード]]" => "[[発送先_取引先コード]]",
                    "[[発送先名]]" => "[[発送先_取引先名]]",
                    "[[発送先郵便番号]]" => "[[発送先_郵便番号]]",
                    "[[発送先住所1]]" => "[[発送先_住所1]]",
                    "[[発送先住所2]]" => "[[発送先_住所2]]",
                    "[[発送先電話番号]]" => "[[発送先_電話番号]]",
                    "[[発送先ファックス番号]]" => "[[発送先_ファックス番号]]",
                    "[[発送先納入場所]]" => "[[発送先_納入場所]]",
                    "[[発送先備考1]]" => "[[発送先_備考1]]",
                    "[[発送先備考2]]" => "[[発送先_備考2]]",
                    "[[発送先備考3]]" => "[[発送先_備考3]]",
                    "[[発送先備考4]]" => "[[発送先_備考4]]",
                    "[[発送先備考5]]" => "[[発送先_備考5]]",
                    "[[自社担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[自社部門名]]" => "[[部門マスタ_部門名]]",
                    "[[取引通貨]]" => "[[通貨マスタ_通貨]]",
                    "[[管理単位]]" => "[[品目マスタ_管理単位]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[入数]]" => "[[品目マスタ_入数]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[受注品目コード]]" => "[[注文_受注品目コード]]",
                    "[[受注品目名]]" => "[[注文_受注品目名]]",
                    "[[出荷先名]]" => "[[注文_受注発送先名]]",
                    "[[総合計金額]]" => "[[注文_総合計金額]]",
                    "[[総合計消費税]]" => "[[注文_総合計消費税]]",
                    "[[総税込金額]]" => "[[注文_総税込金額]]",
                );
                break;
            case "PartnerSubcontract" :
                $action = "Partner_Subcontract_Report";
                $repArr = array(
                    "[[発注日]]" => "[[外製指示_発行日]]",
                    "[[備考]]" => "[[外製指示_備考]]",
                    "[[オーダー番号]]" => "[[外製指示_オーダー番号]]",
                    "[[品目コード]]" => "[[外製指示_品目コード]]",
                    "[[品目名]]" => "[[外製指示_品目名]]",
                    "[[数量]]" => "[[外製指示_数量]]",
                    "[[管理単位数量]]" => "[[外製指示_管理単位数量]]",
                    "[[箱数]]" => "[[外製指示_箱数]]",
                    "[[手配単位倍数]]" => "[[外製指示_手配単位倍数]]",
                    "[[単位]]" => "[[外製指示_単位]]",
                    "[[単価]]" => "[[外製指示_単価]]",
                    "[[金額]]" => "[[外製指示_金額]]",
                    "[[消費税]]" => "[[外製指示_消費税]]",
                    "[[課税区分]]" => "[[外製指示_課税区分]]",
                    "[[税込金額]]" => "[[外製指示_税込金額]]",
                    "[[納期]]" => "[[外製指示_納期]]",
                    "[[発注残]]" => "[[外製指示_残数]]",
                    "[[製番]]" => "[[外製指示_製番]]",
                    "[[型番]]" => "[[外製指示_メーカー型番]]",
                    "[[工程名]]" => "[[外製指示_工程名]]",
                    "[[工程メモ1]]" => "[[外製指示_工程メモ1]]",
                    "[[工程メモ2]]" => "[[外製指示_工程メモ2]]",
                    "[[工程メモ3]]" => "[[外製指示_工程メモ3]]",
                    "[[出荷先]]" => "[[外製指示_発送先]]",
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[取引先_郵便番号]]",
                    "[[取引先住所1]]" => "[[取引先_住所1]]",
                    "[[取引先住所2]]" => "[[取引先_住所2]]",
                    "[[取引先電話番号]]" => "[[取引先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[取引先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[取引先_担当者]]",
                    "[[取引先納入場所]]" => "[[取引先_納入場所]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[自社担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[自社部門名]]" => "[[部門マスタ_部門名]]",
                    "[[管理単位]]" => "[[品目マスタ_管理単位]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[入数]]" => "[[品目マスタ_入数]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注備考]]" => "[[受注_備考1]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[受注品目コード]]" => "[[外製指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[外製指示_受注品目名]]",
                    "[[出荷先名]]" => "[[外製指示_受注発送先名]]",
                );
                break;
            case "PartnerSubcontract2" :
                $action = "Partner_Subcontract_Report2";
                $repArr = array(
                    "[[製造開始日]]" => "[[外製指示_発行日]]",
                    "[[備考]]" => "[[外製指示_備考]]",
                    "[[オーダー番号]]" => "[[外製指示_オーダー番号]]",
                    "[[品目コード]]" => "[[外製指示_品目コード]]",
                    "[[品目名]]" => "[[外製指示_品目名]]",
                    "[[数量]]" => "[[外製指示_数量]]",
                    "[[単位]]" => "[[外製指示_単位]]",
                    "[[納期]]" => "[[外製指示_納期]]",
                    "[[製番]]" => "[[外製指示_製番]]",
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[取引先_郵便番号]]",
                    "[[取引先住所1]]" => "[[取引先_住所1]]",
                    "[[取引先住所2]]" => "[[取引先_住所2]]",
                    "[[取引先電話番号]]" => "[[取引先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[取引先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[取引先_担当者]]",
                    "[[取引先納入場所]]" => "[[取引先_納入場所]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[リードタイム]]" => "[[品目マスタ_リードタイム]]",
                    "[[安全リードタイム]]" => "[[品目マスタ_安全リードタイム]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[受注品目コード]]" => "[[外製指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[外製指示_受注品目名]]",
                    "[[出荷先名]]" => "[[外製指示_受注発送先名]]",
                    "[[子品目コード]]" => "[[外製指示_子品目コード]]",
                    "[[子品目名]]" => "[[外製指示_子品目名]]",
                    "[[員数]]" => "[[外製指示_員数]]",
                    "[[子品目数]]" => "[[外製指示_子品目数]]",
                    "[[子品目支給単価]]" => "[[外製指示_子品目支給単価]]",
                    "[[子品目単位]]" => "[[外製指示_子品目単位]]",
                    "[[子品目仕様]]" => "[[外製指示_子品目仕様]]",
                    "[[子品目メーカー]]" => "[[外製指示_子品目メーカー]]",
                    "[[子品目棚番]]" => "[[外製指示_子品目棚番]]",
                    "[[子品目グループコード]]" => "[[外製指示_子品目グループコード]]",
                    "[[子品目グループ名]]" => "[[外製指示_子品目グループ名]]",
                    "[[子品目備考1]]" => "[[外製指示_子品目備考1]]",
                    "[[子品目備考2]]" => "[[外製指示_子品目備考2]]",
                    "[[子品目備考3]]" => "[[外製指示_子品目備考3]]",
                    "[[子品目備考4]]" => "[[外製指示_子品目備考4]]",
                    "[[子品目備考5]]" => "[[外製指示_子品目備考5]]",
                );
                break;
            case "PartnerSubcontract3" :
                $action = "Partner_Subcontract_Report2";
                $repArr = array(
                    "[[発注日]]" => "[[外製指示_発行日]]",
                    "[[備考]]" => "[[外製指示_備考]]",
                    "[[オーダー番号]]" => "[[外製指示_オーダー番号]]",
                    "[[品目コード]]" => "[[外製指示_品目コード]]",
                    "[[品目名]]" => "[[外製指示_品目名]]",
                    "[[数量]]" => "[[外製指示_数量]]",
                    "[[単位]]" => "[[外製指示_単位]]",
                    "[[単価]]" => "[[外製指示_単価]]",
                    "[[金額]]" => "[[外製指示_金額]]",
                    "[[消費税]]" => "[[外製指示_消費税]]",
                    "[[課税区分]]" => "[[外製指示_課税区分]]",
                    "[[税込金額]]" => "[[外製指示_税込金額]]",
                    "[[納期]]" => "[[外製指示_納期]]",
                    "[[製番]]" => "[[外製指示_製番]]",
                    "[[型番]]" => "[[外製指示_メーカー型番]]",
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[取引先_郵便番号]]",
                    "[[取引先住所1]]" => "[[取引先_住所1]]",
                    "[[取引先住所2]]" => "[[取引先_住所2]]",
                    "[[取引先電話番号]]" => "[[取引先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[取引先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[取引先_担当者]]",
                    "[[取引先納入場所]]" => "[[取引先_納入場所]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[自社担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[自社部門名]]" => "[[部門マスタ_部門名]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[受注品目コード]]" => "[[外製指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[外製指示_受注品目名]]",
                    "[[出荷先名]]" => "[[外製指示_受注発送先名]]",
                );
                break;
            case "PartnerSubcontract4" :
                $action = "Partner_Subcontract_Report4";
                $repArr = array(
                    "[[製造開始日]]" => "[[外製指示_発行日]]",
                    "[[備考]]" => "[[外製指示_備考]]",
                    "[[オーダー番号]]" => "[[外製指示_オーダー番号]]",
                    "[[品目コード]]" => "[[外製指示_品目コード]]",
                    "[[品目名]]" => "[[外製指示_品目名]]",
                    "[[数量]]" => "[[外製指示_数量]]",
                    "[[単位]]" => "[[外製指示_単位]]",
                    "[[納期]]" => "[[外製指示_納期]]",
                    "[[製番]]" => "[[外製指示_製番]]",
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先郵便番号]]" => "[[取引先_郵便番号]]",
                    "[[取引先住所1]]" => "[[取引先_住所1]]",
                    "[[取引先住所2]]" => "[[取引先_住所2]]",
                    "[[取引先電話番号]]" => "[[取引先_電話番号]]",
                    "[[取引先ファックス番号]]" => "[[取引先_ファックス番号]]",
                    "[[取引先担当者名]]" => "[[取引先_担当者]]",
                    "[[取引先納入場所]]" => "[[取引先_納入場所]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番]]" => "[[品目マスタ_棚番]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[リードタイム]]" => "[[品目マスタ_リードタイム]]",
                    "[[安全リードタイム]]" => "[[品目マスタ_安全リードタイム]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[受注品目コード]]" => "[[外製指示_受注品目コード]]",
                    "[[受注品目名]]" => "[[外製指示_受注品目名]]",
                    "[[出荷先名]]" => "[[外製指示_受注発送先名]]",
                    "[[子品目コード]]" => "[[外製指示_子品目コード]]",
                    "[[子品目名]]" => "[[外製指示_子品目名]]",
                    "[[員数]]" => "[[外製指示_員数]]",
                    "[[子品目数]]" => "[[外製指示_子品目数]]",
                    "[[子品目支給単価]]" => "[[外製指示_子品目支給単価]]",
                    "[[子品目単位]]" => "[[外製指示_子品目単位]]",
                    "[[子品目仕様]]" => "[[外製指示_子品目仕様]]",
                    "[[子品目メーカー]]" => "[[外製指示_子品目メーカー]]",
                    "[[子品目棚番]]" => "[[外製指示_子品目棚番]]",
                    "[[子品目グループコード]]" => "[[外製指示_子品目グループコード]]",
                    "[[子品目グループ名]]" => "[[外製指示_子品目グループ名]]",
                    "[[子品目備考1]]" => "[[外製指示_子品目備考1]]",
                    "[[子品目備考2]]" => "[[外製指示_子品目備考2]]",
                    "[[子品目備考3]]" => "[[外製指示_子品目備考3]]",
                    "[[子品目備考4]]" => "[[外製指示_子品目備考4]]",
                    "[[子品目備考5]]" => "[[外製指示_子品目備考5]]",
                );
                break;
            case "PaymentCalendar" :
                $action = "Partner_PaymentCalendar_Report";
                $repArr = array(
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[開始日]]" => "[[支払予定表_開始日]]",
                    "[[終了日]]" => "[[支払予定表_終了日]]",
                    "[[通貨]]" => "[[支払予定表_通貨]]",
                    "[[支払サイクル]]" => "[[支払予定表_支払サイクル]]",
                    "[[合計税込仕入額]]" => "[[支払予定表_合計税込仕入額]]",
                    "[[合計税別仕入額]]" => "[[支払予定表_合計税別仕入額]]",
                    "[[合計税額]]" => "[[支払予定表_合計税額]]",
                    "[[支払予定日1]]" => "[[支払予定表_支払予定日1]]",
                    "[[支払予定日2]]" => "[[支払予定表_支払予定日2]]",
                    "[[支払予定日3]]" => "[[支払予定表_支払予定日3]]",
                    "[[支払予定日4]]" => "[[支払予定表_支払予定日4]]",
                    "[[支払予定日5]]" => "[[支払予定表_支払予定日5]]",
                    "[[支払予定日6]]" => "[[支払予定表_支払予定日6]]",
                    "[[支払予定日7]]" => "[[支払予定表_支払予定日7]]",
                    "[[支払予定日8]]" => "[[支払予定表_支払予定日8]]",
                    "[[支払予定日9]]" => "[[支払予定表_支払予定日9]]",
                    "[[支払予定日10]]" => "[[支払予定表_支払予定日10]]",
                    "[[支払予定日11]]" => "[[支払予定表_支払予定日11]]",
                    "[[支払予定日12]]" => "[[支払予定表_支払予定日12]]",
                    "[[支払予定日13]]" => "[[支払予定表_支払予定日13]]",
                    "[[支払予定日14]]" => "[[支払予定表_支払予定日14]]",
                    "[[支払予定日15]]" => "[[支払予定表_支払予定日15]]",
                    "[[支払予定日16]]" => "[[支払予定表_支払予定日16]]",
                    "[[支払予定日17]]" => "[[支払予定表_支払予定日17]]",
                    "[[支払予定日18]]" => "[[支払予定表_支払予定日18]]",
                    "[[税込仕入額1]]" => "[[支払予定表_税込仕入額1]]",
                    "[[税込仕入額2]]" => "[[支払予定表_税込仕入額2]]",
                    "[[税込仕入額3]]" => "[[支払予定表_税込仕入額3]]",
                    "[[税込仕入額4]]" => "[[支払予定表_税込仕入額4]]",
                    "[[税込仕入額5]]" => "[[支払予定表_税込仕入額5]]",
                    "[[税込仕入額6]]" => "[[支払予定表_税込仕入額6]]",
                    "[[税込仕入額7]]" => "[[支払予定表_税込仕入額7]]",
                    "[[税込仕入額8]]" => "[[支払予定表_税込仕入額8]]",
                    "[[税込仕入額9]]" => "[[支払予定表_税込仕入額9]]",
                    "[[税込仕入額10]]" => "[[支払予定表_税込仕入額10]]",
                    "[[税込仕入額11]]" => "[[支払予定表_税込仕入額11]]",
                    "[[税込仕入額12]]" => "[[支払予定表_税込仕入額12]]",
                    "[[税込仕入額13]]" => "[[支払予定表_税込仕入額13]]",
                    "[[税込仕入額14]]" => "[[支払予定表_税込仕入額14]]",
                    "[[税込仕入額15]]" => "[[支払予定表_税込仕入額15]]",
                    "[[税込仕入額16]]" => "[[支払予定表_税込仕入額16]]",
                    "[[税込仕入額17]]" => "[[支払予定表_税込仕入額17]]",
                    "[[税込仕入額18]]" => "[[支払予定表_税込仕入額18]]",
                    "[[税別仕入額1]]" => "[[支払予定表_税別仕入額1]]",
                    "[[税別仕入額2]]" => "[[支払予定表_税別仕入額2]]",
                    "[[税別仕入額3]]" => "[[支払予定表_税別仕入額3]]",
                    "[[税別仕入額4]]" => "[[支払予定表_税別仕入額4]]",
                    "[[税別仕入額5]]" => "[[支払予定表_税別仕入額5]]",
                    "[[税別仕入額6]]" => "[[支払予定表_税別仕入額6]]",
                    "[[税別仕入額7]]" => "[[支払予定表_税別仕入額7]]",
                    "[[税別仕入額8]]" => "[[支払予定表_税別仕入額8]]",
                    "[[税別仕入額9]]" => "[[支払予定表_税別仕入額9]]",
                    "[[税別仕入額10]]" => "[[支払予定表_税別仕入額10]]",
                    "[[税別仕入額11]]" => "[[支払予定表_税別仕入額11]]",
                    "[[税別仕入額12]]" => "[[支払予定表_税別仕入額12]]",
                    "[[税別仕入額13]]" => "[[支払予定表_税別仕入額13]]",
                    "[[税別仕入額14]]" => "[[支払予定表_税別仕入額14]]",
                    "[[税別仕入額15]]" => "[[支払予定表_税別仕入額15]]",
                    "[[税別仕入額16]]" => "[[支払予定表_税別仕入額16]]",
                    "[[税別仕入額17]]" => "[[支払予定表_税別仕入額17]]",
                    "[[税別仕入額18]]" => "[[支払予定表_税別仕入額18]]",
                    "[[税額1]]" => "[[支払予定表_税額1]]",
                    "[[税額2]]" => "[[支払予定表_税額2]]",
                    "[[税額3]]" => "[[支払予定表_税額3]]",
                    "[[税額4]]" => "[[支払予定表_税額4]]",
                    "[[税額5]]" => "[[支払予定表_税額5]]",
                    "[[税額6]]" => "[[支払予定表_税額6]]",
                    "[[税額7]]" => "[[支払予定表_税額7]]",
                    "[[税額8]]" => "[[支払予定表_税額8]]",
                    "[[税額9]]" => "[[支払予定表_税額9]]",
                    "[[税額10]]" => "[[支払予定表_税額10]]",
                    "[[税額11]]" => "[[支払予定表_税額11]]",
                    "[[税額12]]" => "[[支払予定表_税額12]]",
                    "[[税額13]]" => "[[支払予定表_税額13]]",
                    "[[税額14]]" => "[[支払予定表_税額14]]",
                    "[[税額15]]" => "[[支払予定表_税額15]]",
                    "[[税額16]]" => "[[支払予定表_税額16]]",
                    "[[税額17]]" => "[[支払予定表_税額17]]",
                    "[[税額18]]" => "[[支払予定表_税額18]]",
                );
                break;
            case "PaymentDetailList" :
                $action = "Partner_PaymentList_Report2";
                $repArr = array(
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[開始日]]" => "[[買掛残高表_開始日]]",
                    "[[終了日]]" => "[[買掛残高表_終了日]]",
                    "[[通貨]]" => "[[買掛残高表_通貨]]",
                    "[[繰越額]]" => "[[買掛残高表_繰越額]]",
                    "[[期間中仕入額]]" => "[[買掛残高表_期間中仕入額]]",
                    "[[期間中消費税額]]" => "[[買掛残高表_期間中消費税額]]",
                    "[[期間中支払額]]" => "[[買掛残高表_期間中支払額]]",
                    "[[期間中調整額]]" => "[[買掛残高表_期間中調整額]]",
                    "[[買掛金残高]]" => "[[買掛残高表_買掛金残高]]",
                    "[[期間中現金支払額]]" => "[[買掛残高表_期間中現金支払額]]",
                    "[[期間中振込支払額]]" => "[[買掛残高表_期間中振込支払額]]",
                    "[[期間中小切手支払額]]" => "[[買掛残高表_期間中小切手支払額]]",
                    "[[期間中手形支払額]]" => "[[買掛残高表_期間中手形支払額]]",
                    "[[期間中相殺支払額]]" => "[[買掛残高表_期間中相殺支払額]]",
                    "[[期間中値引支払額]]" => "[[買掛残高表_期間中値引支払額]]",
                    "[[期間中振込手数料支払額]]" => "[[買掛残高表_期間中振込手数料支払額]]",
                    "[[期間中その他支払額]]" => "[[買掛残高表_期間中その他支払額]]",
                    "[[受入日]]" => "[[買掛残高表_受入日]]",
                    "[[検収日]]" => "[[買掛残高表_検収日]]",
                    "[[品目コード]]" => "[[買掛残高表_品目コード]]",
                    "[[品目名]]" => "[[買掛残高表_品目名]]",
                    "[[数量]]" => "[[買掛残高表_数量]]",
                    "[[単価]]" => "[[買掛残高表_単価]]",
                    "[[金額]]" => "[[買掛残高表_金額]]",
                    "[[品目グループコード1]]" => "[[買掛残高表_品目グループコード1]]",
                    "[[品目グループコード2]]" => "[[買掛残高表_品目グループコード2]]",
                    "[[品目グループコード3]]" => "[[買掛残高表_品目グループコード3]]",
                    "[[品目グループ名1]]" => "[[買掛残高表_品目グループ名1]]",
                    "[[品目グループ名2]]" => "[[買掛残高表_品目グループ名2]]",
                    "[[品目グループ名3]]" => "[[買掛残高表_品目グループ名3]]",
                    "[[仕様]]" => "[[買掛残高表_仕様]]",
                    "[[メーカー]]" => "[[買掛残高表_メーカー]]",
                    "[[棚番]]" => "[[買掛残高表_棚番]]",
                    "[[品目備考1]]" => "[[買掛残高表_品目備考1]]",
                    "[[品目備考2]]" => "[[買掛残高表_品目備考2]]",
                    "[[品目備考3]]" => "[[買掛残高表_品目備考3]]",
                    "[[品目備考4]]" => "[[買掛残高表_品目備考4]]",
                    "[[品目備考5]]" => "[[買掛残高表_品目備考5]]",
                );
                break;
            case "PaymentList" :
                $action = "Partner_PaymentList_Report";
                $repArr = array(
                    "[[取引先コード]]" => "[[取引先_取引先コード]]",
                    "[[取引先名]]" => "[[取引先_取引先名]]",
                    "[[取引先備考1]]" => "[[取引先_備考1]]",
                    "[[取引先備考2]]" => "[[取引先_備考2]]",
                    "[[取引先備考3]]" => "[[取引先_備考3]]",
                    "[[取引先備考4]]" => "[[取引先_備考4]]",
                    "[[取引先備考5]]" => "[[取引先_備考5]]",
                    "[[開始日]]" => "[[買掛残高表_開始日]]",
                    "[[終了日]]" => "[[買掛残高表_終了日]]",
                    "[[通貨]]" => "[[買掛残高表_通貨]]",
                    "[[繰越額]]" => "[[買掛残高表_繰越額]]",
                    "[[期間中仕入額]]" => "[[買掛残高表_期間中仕入額]]",
                    "[[期間中消費税額]]" => "[[買掛残高表_期間中消費税額]]",
                    "[[期間中支払額]]" => "[[買掛残高表_期間中支払額]]",
                    "[[期間中調整額]]" => "[[買掛残高表_期間中調整額]]",
                    "[[買掛金残高]]" => "[[買掛残高表_買掛金残高]]",
                    "[[期間中現金支払額]]" => "[[買掛残高表_期間中現金支払額]]",
                    "[[期間中振込支払額]]" => "[[買掛残高表_期間中振込支払額]]",
                    "[[期間中小切手支払額]]" => "[[買掛残高表_期間中小切手支払額]]",
                    "[[期間中手形支払額]]" => "[[買掛残高表_期間中手形支払額]]",
                    "[[期間中相殺支払額]]" => "[[買掛残高表_期間中相殺支払額]]",
                    "[[期間中値引支払額]]" => "[[買掛残高表_期間中値引支払額]]",
                    "[[期間中振込手数料支払額]]" => "[[買掛残高表_期間中振込手数料支払額]]",
                    "[[期間中その他支払額]]" => "[[買掛残高表_期間中その他支払額]]",
                );
                break;
            case "ReceivableCalendar" :
                $action = "Delivery_ReceivableCalendar_Report";
                $repArr = array(
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[締日グループ]]" => "[[得意先_締日グループ]]",
                    "[[請求パターン]]" => "[[得意先_請求パターン]]",
                    "[[回収サイクル]]" => "[[得意先_回収サイクル表示]]",
                    "[[開始日]]" => "[[回収予定表_開始日]]",
                    "[[終了日]]" => "[[回収予定表_終了日]]",
                    "[[通貨]]" => "[[回収予定表_通貨]]",
                    "[[合計税込売上額]]" => "[[回収予定表_合計税込売上額]]",
                    "[[合計税別売上額]]" => "[[回収予定表_合計税別売上額]]",
                    "[[合計税額]]" => "[[回収予定表_合計税額]]",
                    "[[回収予定日1]]" => "[[回収予定表_回収予定日1]]",
                    "[[回収予定日2]]" => "[[回収予定表_回収予定日2]]",
                    "[[回収予定日3]]" => "[[回収予定表_回収予定日3]]",
                    "[[回収予定日4]]" => "[[回収予定表_回収予定日4]]",
                    "[[回収予定日5]]" => "[[回収予定表_回収予定日5]]",
                    "[[回収予定日6]]" => "[[回収予定表_回収予定日6]]",
                    "[[回収予定日7]]" => "[[回収予定表_回収予定日7]]",
                    "[[回収予定日8]]" => "[[回収予定表_回収予定日8]]",
                    "[[回収予定日9]]" => "[[回収予定表_回収予定日9]]",
                    "[[回収予定日10]]" => "[[回収予定表_回収予定日10]]",
                    "[[回収予定日11]]" => "[[回収予定表_回収予定日11]]",
                    "[[回収予定日12]]" => "[[回収予定表_回収予定日12]]",
                    "[[回収予定日13]]" => "[[回収予定表_回収予定日13]]",
                    "[[回収予定日14]]" => "[[回収予定表_回収予定日14]]",
                    "[[回収予定日15]]" => "[[回収予定表_回収予定日15]]",
                    "[[回収予定日16]]" => "[[回収予定表_回収予定日16]]",
                    "[[回収予定日17]]" => "[[回収予定表_回収予定日17]]",
                    "[[回収予定日18]]" => "[[回収予定表_回収予定日18]]",
                    "[[税込売上額1]]" => "[[回収予定表_税込売上額1]]",
                    "[[税込売上額2]]" => "[[回収予定表_税込売上額2]]",
                    "[[税込売上額3]]" => "[[回収予定表_税込売上額3]]",
                    "[[税込売上額4]]" => "[[回収予定表_税込売上額4]]",
                    "[[税込売上額5]]" => "[[回収予定表_税込売上額5]]",
                    "[[税込売上額6]]" => "[[回収予定表_税込売上額6]]",
                    "[[税込売上額7]]" => "[[回収予定表_税込売上額7]]",
                    "[[税込売上額8]]" => "[[回収予定表_税込売上額8]]",
                    "[[税込売上額9]]" => "[[回収予定表_税込売上額9]]",
                    "[[税込売上額10]]" => "[[回収予定表_税込売上額10]]",
                    "[[税込売上額11]]" => "[[回収予定表_税込売上額11]]",
                    "[[税込売上額12]]" => "[[回収予定表_税込売上額12]]",
                    "[[税込売上額13]]" => "[[回収予定表_税込売上額13]]",
                    "[[税込売上額14]]" => "[[回収予定表_税込売上額14]]",
                    "[[税込売上額15]]" => "[[回収予定表_税込売上額15]]",
                    "[[税込売上額16]]" => "[[回収予定表_税込売上額16]]",
                    "[[税込売上額17]]" => "[[回収予定表_税込売上額17]]",
                    "[[税込売上額18]]" => "[[回収予定表_税込売上額18]]",
                    "[[税別売上額1]]" => "[[回収予定表_税別売上額1]]",
                    "[[税別売上額2]]" => "[[回収予定表_税別売上額2]]",
                    "[[税別売上額3]]" => "[[回収予定表_税別売上額3]]",
                    "[[税別売上額4]]" => "[[回収予定表_税別売上額4]]",
                    "[[税別売上額5]]" => "[[回収予定表_税別売上額5]]",
                    "[[税別売上額6]]" => "[[回収予定表_税別売上額6]]",
                    "[[税別売上額7]]" => "[[回収予定表_税別売上額7]]",
                    "[[税別売上額8]]" => "[[回収予定表_税別売上額8]]",
                    "[[税別売上額9]]" => "[[回収予定表_税別売上額9]]",
                    "[[税別売上額10]]" => "[[回収予定表_税別売上額10]]",
                    "[[税別売上額11]]" => "[[回収予定表_税別売上額11]]",
                    "[[税別売上額12]]" => "[[回収予定表_税別売上額12]]",
                    "[[税別売上額13]]" => "[[回収予定表_税別売上額13]]",
                    "[[税別売上額14]]" => "[[回収予定表_税別売上額14]]",
                    "[[税別売上額15]]" => "[[回収予定表_税別売上額15]]",
                    "[[税別売上額16]]" => "[[回収予定表_税別売上額16]]",
                    "[[税別売上額17]]" => "[[回収予定表_税別売上額17]]",
                    "[[税別売上額18]]" => "[[回収予定表_税別売上額18]]",
                    "[[税額1]]" => "[[回収予定表_税額1]]",
                    "[[税額2]]" => "[[回収予定表_税額2]]",
                    "[[税額3]]" => "[[回収予定表_税額3]]",
                    "[[税額4]]" => "[[回収予定表_税額4]]",
                    "[[税額5]]" => "[[回収予定表_税額5]]",
                    "[[税額6]]" => "[[回収予定表_税額6]]",
                    "[[税額7]]" => "[[回収予定表_税額7]]",
                    "[[税額8]]" => "[[回収予定表_税額8]]",
                    "[[税額9]]" => "[[回収予定表_税額9]]",
                    "[[税額10]]" => "[[回収予定表_税額10]]",
                    "[[税額11]]" => "[[回収予定表_税額11]]",
                    "[[税額12]]" => "[[回収予定表_税額12]]",
                    "[[税額13]]" => "[[回収予定表_税額13]]",
                    "[[税額14]]" => "[[回収予定表_税額14]]",
                    "[[税額15]]" => "[[回収予定表_税額15]]",
                    "[[税額16]]" => "[[回収予定表_税額16]]",
                    "[[税額17]]" => "[[回収予定表_税額17]]",
                    "[[税額18]]" => "[[回収予定表_税額18]]",
                );
                break;
            case "ReceivableDetailList" :
                $action = "Delivery_ReceivableList_Report2";
                $repArr = array(
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[取引先備考1]]" => "[[得意先_備考1]]",
                    "[[取引先備考2]]" => "[[得意先_備考2]]",
                    "[[取引先備考3]]" => "[[得意先_備考3]]",
                    "[[取引先備考4]]" => "[[得意先_備考4]]",
                    "[[取引先備考5]]" => "[[得意先_備考5]]",
                    "[[開始日]]" => "[[売掛残高表_開始日]]",
                    "[[終了日]]" => "[[売掛残高表_終了日]]",
                    "[[通貨]]" => "[[売掛残高表_通貨]]",
                    "[[モード]]" => "[[売掛残高表_モード]]",
                    "[[繰越額]]" => "[[売掛残高表_繰越額]]",
                    "[[期間中売上額]]" => "[[売掛残高表_期間中売上額]]",
                    "[[期間中消費税額]]" => "[[売掛残高表_期間中消費税額]]",
                    "[[期間中入金額]]" => "[[売掛残高表_期間中入金額]]",
                    "[[売掛金残高]]" => "[[売掛残高表_売掛金残高]]",
                    "[[期間中現金入金額]]" => "[[売掛残高表_期間中現金入金額]]",
                    "[[期間中振込入金額]]" => "[[売掛残高表_期間中振込入金額]]",
                    "[[期間中小切手入金額]]" => "[[売掛残高表_期間中小切手入金額]]",
                    "[[期間中手形入金額]]" => "[[売掛残高表_期間中手形入金額]]",
                    "[[期間中相殺入金額]]" => "[[売掛残高表_期間中相殺入金額]]",
                    "[[期間中値引入金額]]" => "[[売掛残高表_期間中値引入金額]]",
                    "[[期間中振込手数料入金額]]" => "[[売掛残高表_期間中振込手数料入金額]]",
                    "[[期間中その他入金額]]" => "[[売掛残高表_期間中その他入金額]]",
                    "[[納品日]]" => "[[売掛残高表_納品日]]",
                    "[[検収日]]" => "[[売掛残高表_検収日]]",
                    "[[品目コード]]" => "[[売掛残高表_品目コード]]",
                    "[[品目名]]" => "[[売掛残高表_品目名]]",
                    "[[数量]]" => "[[売掛残高表_数量]]",
                    "[[単価]]" => "[[売掛残高表_単価]]",
                    "[[金額]]" => "[[売掛残高表_金額]]",
                    "[[品目グループコード1]]" => "[[売掛残高表_品目グループコード1]]",
                    "[[品目グループコード2]]" => "[[売掛残高表_品目グループコード2]]",
                    "[[品目グループコード3]]" => "[[売掛残高表_品目グループコード3]]",
                    "[[品目グループ名1]]" => "[[売掛残高表_品目グループ名1]]",
                    "[[品目グループ名2]]" => "[[売掛残高表_品目グループ名2]]",
                    "[[品目グループ名3]]" => "[[売掛残高表_品目グループ名3]]",
                    "[[仕様]]" => "[[売掛残高表_仕様]]",
                    "[[メーカー]]" => "[[売掛残高表_メーカー]]",
                    "[[棚番]]" => "[[売掛残高表_棚番]]",
                    "[[品目備考1]]" => "[[売掛残高表_品目備考1]]",
                    "[[品目備考2]]" => "[[売掛残高表_品目備考2]]",
                    "[[品目備考3]]" => "[[売掛残高表_品目備考3]]",
                    "[[品目備考4]]" => "[[売掛残高表_品目備考4]]",
                    "[[品目備考5]]" => "[[売掛残高表_品目備考5]]",
                );
                break;
            case "ReceivableList" :
                $action = "Delivery_ReceivableList_Report";
                $repArr = array(
                    "[[取引先コード]]" => "[[得意先_取引先コード]]",
                    "[[取引先名]]" => "[[得意先_取引先名]]",
                    "[[取引先備考1]]" => "[[得意先_備考1]]",
                    "[[取引先備考2]]" => "[[得意先_備考2]]",
                    "[[取引先備考3]]" => "[[得意先_備考3]]",
                    "[[取引先備考4]]" => "[[得意先_備考4]]",
                    "[[取引先備考5]]" => "[[得意先_備考5]]",
                    "[[開始日]]" => "[[売掛残高表_開始日]]",
                    "[[終了日]]" => "[[売掛残高表_終了日]]",
                    "[[通貨]]" => "[[売掛残高表_通貨]]",
                    "[[モード]]" => "[[売掛残高表_モード]]",
                    "[[繰越額]]" => "[[売掛残高表_繰越額]]",
                    "[[期間中売上額]]" => "[[売掛残高表_期間中売上額]]",
                    "[[期間中消費税額]]" => "[[売掛残高表_期間中消費税額]]",
                    "[[期間中入金額]]" => "[[売掛残高表_期間中入金額]]",
                    "[[売掛金残高]]" => "[[売掛残高表_売掛金残高]]",
                    "[[期間中現金入金額]]" => "[[売掛残高表_期間中現金入金額]]",
                    "[[期間中振込入金額]]" => "[[売掛残高表_期間中振込入金額]]",
                    "[[期間中小切手入金額]]" => "[[売掛残高表_期間中小切手入金額]]",
                    "[[期間中手形入金額]]" => "[[売掛残高表_期間中手形入金額]]",
                    "[[期間中相殺入金額]]" => "[[売掛残高表_期間中相殺入金額]]",
                    "[[期間中値引入金額]]" => "[[売掛残高表_期間中値引入金額]]",
                    "[[期間中振込手数料入金額]]" => "[[売掛残高表_期間中振込手数料入金額]]",
                    "[[期間中その他入金額]]" => "[[売掛残高表_期間中その他入金額]]",
                );
                break;
            case "Received" :
                $action = "Manufacturing_Received_Report";
                $repArr = array(
                    "[[受注残数]]" => "[[受注_残数]]",
                    "[[受注番号]]" => "[[受注_受注番号]]",
                    "[[客先注番]]" => "[[受注_客先注番]]",
                    "[[受注日]]" => "[[受注_受注日]]",
                    "[[受注備考1]]" => "[[受注_備考1]]",
                    "[[受注備考2]]" => "[[受注_備考2]]",
                    "[[受注備考3]]" => "[[受注_備考3]]",
                    "[[受注行番号]]" => "[[受注_行番号]]",
                    "[[受注製番]]" => "[[受注_製番]]",
                    "[[受注数量]]" => "[[受注_受注数]]",
                    "[[受注単価]]" => "[[受注_単価]]",
                    "[[箱数]]" => "[[受注_箱数]]",
                    "[[納期]]" => "[[受注_納期]]",
                    "[[受注明細備考]]" => "[[受注_明細備考1]]",
                    "[[得意先コード]]" => "[[得意先_取引先コード]]",
                    "[[得意先名]]" => "[[得意先_取引先名]]",
                    "[[得意先郵便番号]]" => "[[得意先_郵便番号]]",
                    "[[得意先住所1]]" => "[[得意先_住所1]]",
                    "[[得意先住所2]]" => "[[得意先_住所2]]",
                    "[[得意先電話番号]]" => "[[得意先_電話番号]]",
                    "[[得意先ファックス番号]]" => "[[得意先_ファックス番号]]",
                    "[[得意先メールアドレス]]" => "[[得意先_メールアドレス]]",
                    "[[得意先担当者]]" => "[[得意先_担当者]]",
                    "[[得意先備考1]]" => "[[得意先_備考1]]",
                    "[[得意先備考2]]" => "[[得意先_備考2]]",
                    "[[得意先備考3]]" => "[[得意先_備考3]]",
                    "[[得意先備考4]]" => "[[得意先_備考4]]",
                    "[[得意先備考5]]" => "[[得意先_備考5]]",
                    "[[出荷先コード]]" => "[[発送先_取引先コード]]",
                    "[[出荷先名]]" => "[[発送先_取引先名]]",
                    "[[出荷先郵便番号]]" => "[[発送先_郵便番号]]",
                    "[[出荷先住所1]]" => "[[発送先_住所1]]",
                    "[[出荷先住所2]]" => "[[発送先_住所2]]",
                    "[[出荷先電話番号]]" => "[[発送先_電話番号]]",
                    "[[出荷先ファックス番号]]" => "[[発送先_ファックス番号]]",
                    "[[出荷先メールアドレス]]" => "[[発送先_メールアドレス]]",
                    "[[出荷先担当者]]" => "[[発送先_担当者]]",
                    "[[出荷先備考1]]" => "[[発送先_備考1]]",
                    "[[出荷先備考2]]" => "[[発送先_備考2]]",
                    "[[出荷先備考3]]" => "[[発送先_備考3]]",
                    "[[出荷先備考4]]" => "[[発送先_備考4]]",
                    "[[出荷先備考5]]" => "[[発送先_備考5]]",
                    "[[見積番号]]" => "[[見積_見積番号]]",
                    "[[品目コード]]" => "[[品目マスタ_品目コード]]",
                    "[[品目名]]" => "[[品目マスタ_品目名]]",
                    "[[単位]]" => "[[品目マスタ_管理単位]]",
                    "[[メーカー]]" => "[[品目マスタ_メーカー]]",
                    "[[仕様]]" => "[[品目マスタ_仕様]]",
                    "[[棚番号]]" => "[[品目マスタ_棚番]]",
                    "[[入数]]" => "[[品目マスタ_入数]]",
                    "[[品目備考1]]" => "[[品目マスタ_備考1]]",
                    "[[品目備考2]]" => "[[品目マスタ_備考2]]",
                    "[[品目備考3]]" => "[[品目マスタ_備考3]]",
                    "[[品目備考4]]" => "[[品目マスタ_備考4]]",
                    "[[品目備考5]]" => "[[品目マスタ_備考5]]",
                    "[[品目画像]]" => "[[品目マスタ_画像]]",
                    "[[担当者コード]]" => "[[従業員マスタ_従業員コード]]",
                    "[[担当者名]]" => "[[従業員マスタ_従業員名]]",
                    "[[部門コード]]" => "[[部門マスタ_部門コード]]",
                    "[[部門名]]" => "[[部門マスタ_部門名]]",
                );
                break;
            case "StockMove" :
                $action = "Stock_Move_Report";
                $repArr = array(
                    "[[品目コード]]" => "[[品目マスタ_品目コード]]",
                    "[[品目名]]" => "[[品目マスタ_品目名]]",
                    "[[オーダー番号]]" => "[[製造指示_オーダー番号]]",
                    "[[移動日]]" => "[[移動_移動日]]",
                    "[[移動元ロケーションコード]]" => "[[移動_移動元ロケーションコード]]",
                    "[[移動元ロケーション名]]" => "[[移動_移動元ロケーション名]]",
                    "[[移動先ロケーションコード]]" => "[[移動_移動先ロケーションコード]]",
                    "[[移動先ロケーション名]]" => "[[移動_移動先ロケーション名]]",
                    "[[数量]]" => "[[移動_数量]]",
                    "[[製番]]" => "[[移動_製番]]",
                    "[[備考]]" => "[[移動_備考]]",
                );
                break;
            default:
                // 13iからタグが変更されていない（EDI関連）、もしくは15iで新設された帳票のため変換不要
                return false;
        }

        return array($action, $repArr);

    }
}
